[
  {
    "id": 1,
    "title": "Multi-AI Code Engine - World's First 3-AI Coding System",
    "category": "premium-coding",
    "preview": "Telegram bot combines Gemini 3 + Kimi 2.5 + Claude 4.5. Import n8n workflow → Get ZIP files better than Cursor.",
    "full": "Complete n8n workflow JSON + optimized prompts for world's first multi-AI coding system: 1) Telegram Trigger (text/files), 2) Intent recognition AI Agent, 3) User project storage (Google Drive by user_id), 4) Gemini 3 Logic Planner (debug/planning), 5) Kimi 2.5 Code Generator (creative implementation), 6) Claude Sonnet 4.5 Final Polish (lint/format/validate), 7) Summary generator, 8) ZIP archive creation, 9) Telegram ZIP delivery with changelog. Pay-per-use APIs only ($0.03/request). No file limits, fully editable, beats Cursor Pro. Includes exact setup video script, API key configs, test cases. First 1000 sales @ $12.",
    "premium": true,
    "price": "$12 (First 1000 only)",
    "productLink": "https://gumroad.com/l/multi-ai-code-engine",
    "image": "https://images.unsplash.com/photo-1677442136019-21780ecad995?w=400&h=300&fit=crop"
  },
  {
    "id": 2,
    "title": "Viral VEO3 Shorts Machine: Auto-Generate & Publish YouTube AI Videos Daily",
    "category": "automation",
    "preview": "Complete n8n workflow that auto-generates viral YouTube Shorts with VEO3 AI video + GPT content creation.",
    "full": "Production-ready n8n automation that creates and publishes daily viral-style YouTube Shorts completely hands-free. Features: 1) Daily scheduled GPT-powered viral idea generation (web dev/AI/cybersecurity niches), 2) Structured VEO3 prompt engineering for cinematic 9:16 before/after transformation videos, 3) VEO3 API integration for automatic video rendering, 4) Google Sheets tracking (idea, caption, prompt details, status, YouTube URL), 5) Direct YouTube Shorts upload with optimized titles/captions/hashtags, 6) Full error handling and retry logic, 7) Production-ready workflow with detailed setup instructions. Perfect for creators scaling consistent short-form content. Download the complete n8n workflow JSON and import directly into your n8n instance.",
    "premium": true,
    "workflow": true,
    "downloadUrl": "https://mineblade.gumroad.com/l/jhlmy",
    "fileType": "json",
    "fileName": "veo3-youtube-shorts-automation.json"
  },
  {
    "id": 3,
    "title": "Build an Automated API Monitoring Script",
    "category": "automation",
    "preview": "Create a script that monitors API uptime, logs errors, and sends alerts when issues are detected.",
    "full": "Write a production-ready Node.js script that monitors a REST API endpoint every 5 minutes. The script should log response time, status codes, and failures to a local JSON file. If the API fails more than 3 times consecutively, send an email alert using Nodemailer. Use clean async/await patterns, environment variables for configuration, and include detailed comments explaining each major step. Add graceful shutdown handling and comprehensive error logging.",
    "premium": false
  },
  {
    "id": 4,
    "title": "Create a REST API with Express and MongoDB",
    "category": "backend",
    "preview": "Build a complete RESTful API with authentication, CRUD operations, and MongoDB integration.",
    "full": "Create a production-ready Express.js REST API with the following features: 1) User authentication using JWT tokens, 2) CRUD endpoints for a 'products' resource with validation, 3) MongoDB integration using Mongoose with proper schema design, 4) Middleware for error handling and request logging, 5) Rate limiting to prevent abuse, 6) API documentation using Swagger/OpenAPI, 7) Environment-based configuration, 8) Comprehensive error responses with proper HTTP status codes. Include folder structure recommendations and security best practices.",
    "premium": false
  },
  {
    "id": 5,
    "title": "Python Web Scraper with Error Handling",
    "category": "scripts",
    "preview": "Build a robust web scraper that handles pagination, retries, and exports data to CSV.",
    "full": "Write a Python web scraper using BeautifulSoup and Requests that: 1) Scrapes product data (title, price, rating, URL) from an e-commerce site, 2) Handles pagination automatically, 3) Implements exponential backoff retry logic for failed requests, 4) Respects robots.txt and includes user-agent rotation, 5) Saves data to CSV with proper encoding, 6) Logs progress and errors to a file, 7) Uses command-line arguments for URL and output file. Include detailed comments and exception handling for network errors, missing elements, and rate limiting.",
    "premium": false
  },
  {
    "id": 6,
    "title": "Stripe Payment Integration Guide",
    "category": "apis",
    "preview": "Complete implementation of Stripe payment processing with webhooks and subscription handling.",
    "full": "Create a comprehensive Stripe integration that includes: 1) One-time payment processing with card tokenization, 2) Subscription creation and management with multiple tiers, 3) Webhook handling for payment success/failure events, 4) Customer portal integration for self-service subscription management, 5) Invoice generation and email notifications, 6) Proper error handling and refund processing, 7) Security best practices including signature verification for webhooks. Provide both frontend (React/vanilla JS) and backend (Node.js) code examples with environment configuration.",
    "premium": false
  },
  {
    "id": 7,
    "title": "React Component Library Setup",
    "category": "coding",
    "preview": "Set up a reusable React component library with TypeScript, Storybook, and npm publishing.",
    "full": "Guide me through creating a professional React component library that includes: 1) Project setup with TypeScript, Rollup, and proper package.json configuration, 2) Component development with props validation and TypeScript interfaces, 3) Storybook integration for component documentation and testing, 4) CSS-in-JS styling solution (styled-components or Emotion), 5) Unit testing with Jest and React Testing Library, 6) Automated versioning and changelog generation, 7) npm publishing workflow with GitHub Actions, 8) README with usage examples and contribution guidelines. Include folder structure and best practices for maintainability.",
    "premium": false
  },
  {
    "id": 8,
    "title": "Dockerize a Full-Stack Application",
    "category": "backend",
    "preview": "Create Docker configuration for a complete application with database, backend, and frontend.",
    "full": "Write a complete Docker setup for a full-stack application that includes: 1) Dockerfile for Node.js backend with multi-stage builds, 2) Dockerfile for React frontend with nginx serving, 3) docker-compose.yml orchestrating backend, frontend, PostgreSQL, and Redis, 4) Environment variable management across services, 5) Volume configuration for data persistence, 6) Health checks and restart policies, 7) Development vs production configurations, 8) .dockerignore file optimization. Include commands for building, running, and debugging the containerized application.",
    "premium": false
  },
  {
  "id": 3,
  "title": "Automate Blog Content Creation with GPT-4, Perplexity & WordPress",
  "category": "automation",
  "preview": "Download a complete n8n workflow to automate blog content creation using GPT-4, Perplexity, and WordPress.",
  "full": "Complex multi-step n8n automation that fully automates blog content creation and publishing. This workflow orchestrates GPT-4 for content generation, Perplexity for research and fact-checking, and WordPress for automated publishing. It integrates with Notion for content planning, Lmchatopenai for AI processing, and Slack for real-time notifications and workflow monitoring. Built using 17 nodes and connected to 9 different services, this production-ready automation handles data processing, content structuring, and publishing with minimal human input. Download the complete n8n workflow JSON and import it directly into your n8n instance.",
  "premium": false,
  "workflow": true,
  "downloadUrl": "workflows/automate-blog-content.json",
  "fileType": "json",
  "fileName": "automate-blog-content.json"
  }
]
